log/2019-10-22/2019-10-22-21:04:04
20        Threads
50        Connections per thread
93333     Requests per client


ALL STATS
=========================================================================
Type         Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
-------------------------------------------------------------------------
Sets        34430.34          ---          ---     11.75000      1979.75 
Gets        51641.37     33558.48     18082.89     11.72500      3021.76 
Waits           0.00          ---          ---      0.00000          --- 
Totals      86071.71     33558.48     18082.89     11.73500      5001.51 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.230         0.00
SET       0.240         0.00
SET       0.250         0.00
SET       0.260         0.00
SET       0.270         0.00
SET       0.280         0.00
SET       0.290         0.00
SET       0.300         0.01
SET       0.310         0.01
SET       0.320         0.01
SET       0.330         0.01
SET       0.340         0.01
SET       0.350         0.02
SET       0.360         0.02
SET       0.370         0.02
SET       0.380         0.02
SET       0.390         0.02
SET       0.400         0.02
SET       0.410         0.03
SET       0.420         0.03
SET       0.430         0.03
SET       0.440         0.03
SET       0.450         0.03
SET       0.460         0.03
SET       0.470         0.03
SET       0.480         0.04
SET       0.490         0.04
SET       0.500         0.04
SET       0.510         0.04
SET       0.520         0.04
SET       0.530         0.04
SET       0.540         0.05
SET       0.550         0.05
SET       0.560         0.05
SET       0.570         0.05
SET       0.580         0.05
SET       0.590         0.05
SET       0.600         0.05
SET       0.610         0.06
SET       0.620         0.06
SET       0.630         0.06
SET       0.640         0.06
SET       0.650         0.06
SET       0.660         0.06
SET       0.670         0.07
SET       0.680         0.07
SET       0.690         0.07
SET       0.700         0.07
SET       0.710         0.07
SET       0.720         0.07
SET       0.730         0.07
SET       0.740         0.08
SET       0.750         0.08
SET       0.760         0.08
SET       0.770         0.08
SET       0.780         0.08
SET       0.790         0.08
SET       0.800         0.09
SET       0.810         0.09
SET       0.820         0.09
SET       0.830         0.09
SET       0.840         0.09
SET       0.850         0.09
SET       0.860         0.10
SET       0.870         0.10
SET       0.880         0.10
SET       0.890         0.10
SET       0.900         0.10
SET       0.910         0.10
SET       0.920         0.11
SET       0.930         0.11
SET       0.940         0.11
SET       0.950         0.11
SET       0.960         0.11
SET       0.970         0.11
SET       0.980         0.12
SET       0.990         0.12
SET       1.000         0.13
SET       1.100         0.15
SET       1.200         0.17
SET       1.300         0.20
SET       1.400         0.23
SET       1.500         0.27
SET       1.600         0.31
SET       1.700         0.37
SET       1.800         0.43
SET       1.900         0.49
SET       2.000         0.57
SET       2.100         0.65
SET       2.200         0.73
SET       2.300         0.81
SET       2.400         0.90
SET       2.500         0.98
SET       2.600         1.06
SET       2.700         1.15
SET       2.800         1.25
SET       2.900         1.35
SET       3.000         1.46
SET       3.100         1.56
SET       3.200         1.66
SET       3.300         1.75
SET       3.400         1.83
SET       3.500         1.92
SET       3.600         1.99
SET       3.700         2.07
SET       3.800         2.14
SET       3.900         2.22
SET       4.000         2.30
SET       4.100         2.39
SET       4.200         2.48
SET       4.300         2.59
SET       4.400         2.71
SET       4.500         2.86
SET       4.600         3.03
SET       4.700         3.25
SET       4.800         3.50
SET       4.900         3.78
SET       5.000         4.08
SET       5.100         4.39
SET       5.200         4.71
SET       5.300         5.02
SET       5.400         5.32
SET       5.500         5.62
SET       5.600         5.90
SET       5.700         6.18
SET       5.800         6.45
SET       5.900         6.73
SET       6.000         7.02
SET       6.100         7.32
SET       6.200         7.63
SET       6.300         7.96
SET       6.400         8.31
SET       6.500         8.67
SET       6.600         9.06
SET       6.700         9.47
SET       6.800         9.91
SET       6.900        10.37
SET       7.000        10.86
SET       7.100        11.37
SET       7.200        11.91
SET       7.300        12.49
SET       7.400        13.10
SET       7.500        13.74
SET       7.600        14.42
SET       7.700        15.13
SET       7.800        15.88
SET       7.900        16.67
SET       8.000        17.49
SET       8.100        18.36
SET       8.200        19.25
SET       8.300        20.17
SET       8.400        21.13
SET       8.500        22.13
SET       8.600        23.16
SET       8.700        24.20
SET       8.800        25.29
SET       8.900        26.43
SET       9.000        27.64
SET       9.100        28.92
SET       9.200        30.27
SET       9.300        31.71
SET       9.400        33.24
SET       9.500        34.83
SET       9.600        36.48
SET       9.700        38.11
SET       9.800        39.74
SET       9.900        41.34
SET      10.000        48.92
SET      11.000        57.59
SET      12.000        63.86
SET      13.000        69.83
SET      14.000        76.18
SET      15.000        82.20
SET      16.000        87.16
SET      17.000        90.88
SET      18.000        93.49
SET      19.000        95.23
SET      20.000        96.36
SET      21.000        97.08
SET      22.000        97.56
SET      23.000        97.90
SET      24.000        98.16
SET      25.000        98.37
SET      26.000        98.55
SET      27.000        98.71
SET      28.000        98.85
SET      29.000        98.99
SET      30.000        99.12
SET      31.000        99.24
SET      32.000        99.33
SET      33.000        99.42
SET      34.000        99.49
SET      35.000        99.55
SET      36.000        99.60
SET      37.000        99.64
SET      38.000        99.67
SET      39.000        99.70
SET      40.000        99.73
SET      41.000        99.75
SET      42.000        99.76
SET      43.000        99.78
SET      44.000        99.79
SET      45.000        99.81
SET      46.000        99.82
SET      47.000        99.83
SET      48.000        99.84
SET      49.000        99.85
SET      50.000        99.86
SET      51.000        99.87
SET      52.000        99.88
SET      53.000        99.89
SET      54.000        99.90
SET      55.000        99.90
SET      56.000        99.91
SET      57.000        99.92
SET      58.000        99.92
SET      59.000        99.93
SET      60.000        99.93
SET      61.000        99.94
SET      62.000        99.94
SET      63.000        99.94
SET      64.000        99.95
SET      65.000        99.95
SET      66.000        99.95
SET      67.000        99.95
SET      68.000        99.96
SET      69.000        99.96
SET      70.000        99.96
SET      71.000        99.96
SET      72.000        99.97
SET      73.000        99.97
SET      74.000        99.97
SET      75.000        99.97
SET      76.000        99.97
SET      77.000        99.97
SET      78.000        99.97
SET      79.000        99.97
SET      80.000        99.97
SET      81.000        99.98
SET      82.000        99.98
SET      83.000        99.98
SET      84.000        99.98
SET      85.000        99.98
SET      86.000        99.98
SET      87.000        99.98
SET      88.000        99.98
SET      89.000        99.98
SET      90.000        99.98
SET      91.000        99.98
SET      92.000        99.98
SET      93.000        99.99
SET      94.000        99.99
SET      95.000        99.99
SET      96.000        99.99
SET      97.000        99.99
SET      98.000        99.99
SET      99.000        99.99
SET     100.000        99.99
SET     110.000        99.99
SET     120.000       100.00
SET     130.000       100.00
SET     140.000       100.00
SET     150.000       100.00
SET     160.000       100.00
SET     170.000       100.00
SET     180.000       100.00
SET     190.000       100.00
SET     200.000       100.00
SET     210.000       100.00
SET     230.000       100.00
SET     240.000       100.00
SET     250.000       100.00
SET     260.000       100.00
SET     270.000       100.00
SET     280.000       100.00
SET     290.000       100.00
SET     300.000       100.00
SET     310.000       100.00
SET     330.000       100.00
SET     350.000       100.00
SET     360.000       100.00
SET     370.000       100.00
SET     380.000       100.00
SET     390.000       100.00
SET     400.000       100.00
SET     410.000       100.00
SET     450.000       100.00
SET     460.000       100.00
SET     470.000       100.00
SET     480.000       100.00
SET     490.000       100.00
SET     510.000       100.00
SET     520.000       100.00
SET     540.000       100.00
---
GET       0.220         0.00
GET       0.230         0.00
GET       0.240         0.00
GET       0.250         0.00
GET       0.260         0.00
GET       0.270         0.00
GET       0.280         0.00
GET       0.290         0.01
GET       0.300         0.01
GET       0.310         0.01
GET       0.320         0.01
GET       0.330         0.01
GET       0.340         0.02
GET       0.350         0.02
GET       0.360         0.02
GET       0.370         0.02
GET       0.380         0.02
GET       0.390         0.02
GET       0.400         0.03
GET       0.410         0.03
GET       0.420         0.03
GET       0.430         0.03
GET       0.440         0.03
GET       0.450         0.03
GET       0.460         0.03
GET       0.470         0.04
GET       0.480         0.04
GET       0.490         0.04
GET       0.500         0.04
GET       0.510         0.04
GET       0.520         0.04
GET       0.530         0.05
GET       0.540         0.05
GET       0.550         0.05
GET       0.560         0.05
GET       0.570         0.05
GET       0.580         0.05
GET       0.590         0.06
GET       0.600         0.06
GET       0.610         0.06
GET       0.620         0.06
GET       0.630         0.06
GET       0.640         0.06
GET       0.650         0.06
GET       0.660         0.07
GET       0.670         0.07
GET       0.680         0.07
GET       0.690         0.07
GET       0.700         0.07
GET       0.710         0.07
GET       0.720         0.08
GET       0.730         0.08
GET       0.740         0.08
GET       0.750         0.08
GET       0.760         0.08
GET       0.770         0.08
GET       0.780         0.09
GET       0.790         0.09
GET       0.800         0.09
GET       0.810         0.09
GET       0.820         0.09
GET       0.830         0.09
GET       0.840         0.09
GET       0.850         0.10
GET       0.860         0.10
GET       0.870         0.10
GET       0.880         0.10
GET       0.890         0.10
GET       0.900         0.10
GET       0.910         0.11
GET       0.920         0.11
GET       0.930         0.11
GET       0.940         0.11
GET       0.950         0.11
GET       0.960         0.11
GET       0.970         0.12
GET       0.980         0.12
GET       0.990         0.12
GET       1.000         0.13
GET       1.100         0.15
GET       1.200         0.18
GET       1.300         0.20
GET       1.400         0.24
GET       1.500         0.27
GET       1.600         0.32
GET       1.700         0.37
GET       1.800         0.43
GET       1.900         0.50
GET       2.000         0.57
GET       2.100         0.66
GET       2.200         0.74
GET       2.300         0.82
GET       2.400         0.90
GET       2.500         0.98
GET       2.600         1.07
GET       2.700         1.16
GET       2.800         1.26
GET       2.900         1.36
GET       3.000         1.46
GET       3.100         1.56
GET       3.200         1.66
GET       3.300         1.75
GET       3.400         1.84
GET       3.500         1.92
GET       3.600         2.00
GET       3.700         2.08
GET       3.800         2.15
GET       3.900         2.23
GET       4.000         2.31
GET       4.100         2.40
GET       4.200         2.50
GET       4.300         2.60
GET       4.400         2.73
GET       4.500         2.88
GET       4.600         3.06
GET       4.700         3.28
GET       4.800         3.53
GET       4.900         3.82
GET       5.000         4.13
GET       5.100         4.45
GET       5.200         4.77
GET       5.300         5.09
GET       5.400         5.40
GET       5.500         5.70
GET       5.600         5.98
GET       5.700         6.26
GET       5.800         6.55
GET       5.900         6.83
GET       6.000         7.12
GET       6.100         7.42
GET       6.200         7.74
GET       6.300         8.07
GET       6.400         8.42
GET       6.500         8.79
GET       6.600         9.18
GET       6.700         9.59
GET       6.800        10.04
GET       6.900        10.50
GET       7.000        11.00
GET       7.100        11.52
GET       7.200        12.07
GET       7.300        12.65
GET       7.400        13.26
GET       7.500        13.91
GET       7.600        14.59
GET       7.700        15.31
GET       7.800        16.07
GET       7.900        16.86
GET       8.000        17.69
GET       8.100        18.56
GET       8.200        19.45
GET       8.300        20.38
GET       8.400        21.34
GET       8.500        22.34
GET       8.600        23.37
GET       8.700        24.42
GET       8.800        25.52
GET       8.900        26.66
GET       9.000        27.86
GET       9.100        29.15
GET       9.200        30.50
GET       9.300        31.94
GET       9.400        33.47
GET       9.500        35.06
GET       9.600        36.71
GET       9.700        38.34
GET       9.800        39.96
GET       9.900        41.56
GET      10.000        49.12
GET      11.000        57.76
GET      12.000        64.03
GET      13.000        70.01
GET      14.000        76.35
GET      15.000        82.35
GET      16.000        87.27
GET      17.000        90.97
GET      18.000        93.55
GET      19.000        95.27
GET      20.000        96.40
GET      21.000        97.10
GET      22.000        97.58
GET      23.000        97.92
GET      24.000        98.18
GET      25.000        98.39
GET      26.000        98.56
GET      27.000        98.72
GET      28.000        98.87
GET      29.000        99.01
GET      30.000        99.13
GET      31.000        99.25
GET      32.000        99.34
GET      33.000        99.43
GET      34.000        99.50
GET      35.000        99.56
GET      36.000        99.61
GET      37.000        99.65
GET      38.000        99.68
GET      39.000        99.71
GET      40.000        99.73
GET      41.000        99.75
GET      42.000        99.77
GET      43.000        99.78
GET      44.000        99.80
GET      45.000        99.81
GET      46.000        99.82
GET      47.000        99.83
GET      48.000        99.84
GET      49.000        99.85
GET      50.000        99.86
GET      51.000        99.87
GET      52.000        99.88
GET      53.000        99.89
GET      54.000        99.90
GET      55.000        99.91
GET      56.000        99.91
GET      57.000        99.92
GET      58.000        99.92
GET      59.000        99.93
GET      60.000        99.93
GET      61.000        99.94
GET      62.000        99.94
GET      63.000        99.94
GET      64.000        99.95
GET      65.000        99.95
GET      66.000        99.95
GET      67.000        99.96
GET      68.000        99.96
GET      69.000        99.96
GET      70.000        99.96
GET      71.000        99.96
GET      72.000        99.97
GET      73.000        99.97
GET      74.000        99.97
GET      75.000        99.97
GET      76.000        99.97
GET      77.000        99.97
GET      78.000        99.97
GET      79.000        99.97
GET      80.000        99.98
GET      81.000        99.98
GET      82.000        99.98
GET      83.000        99.98
GET      84.000        99.98
GET      85.000        99.98
GET      86.000        99.98
GET      87.000        99.98
GET      88.000        99.98
GET      89.000        99.98
GET      90.000        99.98
GET      91.000        99.98
GET      92.000        99.99
GET      93.000        99.99
GET      94.000        99.99
GET      95.000        99.99
GET      96.000        99.99
GET      97.000        99.99
GET      98.000        99.99
GET      99.000        99.99
GET     100.000        99.99
GET     110.000        99.99
GET     120.000       100.00
GET     130.000       100.00
GET     140.000       100.00
GET     150.000       100.00
GET     160.000       100.00
GET     170.000       100.00
GET     180.000       100.00
GET     190.000       100.00
GET     200.000       100.00
GET     210.000       100.00
GET     230.000       100.00
GET     240.000       100.00
GET     250.000       100.00
GET     260.000       100.00
GET     270.000       100.00
GET     280.000       100.00
GET     290.000       100.00
GET     300.000       100.00
GET     310.000       100.00
GET     320.000       100.00
GET     330.000       100.00
GET     350.000       100.00
GET     360.000       100.00
GET     370.000       100.00
GET     380.000       100.00
GET     390.000       100.00
GET     400.000       100.00
GET     410.000       100.00
GET     440.000       100.00
GET     450.000       100.00
GET     460.000       100.00
GET     470.000       100.00
GET     480.000       100.00
GET     490.000       100.00
GET     510.000       100.00
GET     520.000       100.00
GET     540.000       100.00
---
total 0